#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_CTYPE, "RUS");
	z1();
	z2();
	z3();
}

int z1()

{
	printf("123\n"); // подзадание 1
	printf("1\n 2\n 3\n", 1, 2, 3); // подзадание 2
	printf("1\n \t2\n \t\t3\n", 1, 2, 3); // подзадание 3
	printf("%d\n%3d\n%5d\n%7d\n", 1, 2, 3, 4); // подзадание 4
	printf("%10.3f\n ", 12.234657); // подзадание 5
	printf("%10.5f\n ", 12.234657); // подзадание 6
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); // подзадание 7
	printf("Деление %d на %d равно %d\n ", 7, 5, 7 / 5); // подзадание 8
	printf("Умножение %d на %d равно %d\n ", 2000, 4, 2000 * 4); // подзадание 9
	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); // подзадание 10.1
	printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 10.2
	printf("%g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000); // подзадание 10.3
	printf("%e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000); // подзадание 10.1
	return 0;
}

int z2()
{
	int N, K;
	N = 15;
	K = 30;
	printf("Сейчас %d часа %d минуты 00 секунд \n", N, K); //Сейчас 15 часов 30 минуты 00 секунд
	printf("Идет %d минута суток \n", ((N * 60) + K)); //Идет 930 минута суток
	printf("До полуночи осталось %d часов и %d минут \n", 24 - N, 60 - K); //До полуночи осталось 9 часов и 30 минут
	printf("С 8.00 прошло %d секунд \n", (((N - 8) * 3600) + (K * 60))); //С 8.00 прошло 27000 секунд
	printf("Текущий час = %1.2f суток и текущая минута = %1.2f часа \n", (N / 24.), (K / 60.));
	return 0;
}

int z3()
{
	float L = 1323;
	float n = 2;
	int k = 3;
	int m = 7;
	printf("Дано: \n %.0f\n %.0f\n -----\n Ответ:\n %+0*.*f", n, L, k + m + 2, m, (n / L));
	return 0;
}